CLIENTS_TEXTS = {
    "start_client": "👋 Добро пожаловать 🟡 🟢 🔴 ⚪️\n\n🗂 Вам доступны следующие команды:",
    "watch_the_draw_client": ("На данный момент активных розыгрышей нет. Если хотите получать уведомления об "
                              'розыгрышах, отправьте текстовую команду - "<code>🔔 Включить уведомления</code>", и '
                              "вам будут приходить уведомления, когда будут создаваться новые розыгрыши, отключить "
                              'можно отправив текстовую команду - <code>🔕 Отключить уведомления"</code>". Эти '
                              'команды можно нажать перейдя в главное меню.'),
    "lottery_created_client": ("<b><i>Создался новый розыгрыш 🎉\nПо скорее успейте купить себе номерки 🤩\n"
                               "Желаем вам удачи 🔥🔥🔥</i></b>"),
    "losed_client": ("<i><b>🎉 По итогам розыгрыша, ваш номерок оказался проигрышным 😞\n"
                     "Но я уверен, в следующих розыгрышах, ваш номерок будет выигрышным 🔥🔥🔥</b></i>"),
    "winners_client": ("<i><b>🎉 ВАААУ❕❕❕ ПО ИТОГАМ РОЗЫГРЫША, ВАШ НОМЕРОК БЫЛ ВЫИГРЫШНЫМ 🔥🔥🔥\n"
                       "Для получения приза, отправьте пожалуйста адрес для доставки приза, нажав на кнопку снизу 👇\n"
                       "Оно запустит цепочку запроса адреса, иначе, ваше сообщение не отправится организаторам.\n"
                       "В скором времени администраторы могут свами связаться 👀</b></i>"),
    "admins_contacts_client": "<b>📞 На данный момент администраторы еще не добавили свои контакты ⚪️</b>",
    "rules_client": ("<code>📑 Правила розыгрыша</code> - когда создается розыгрыш, вы можете купить один или "
                     "несколько номерков розыгрыша. Количество номерков ограничено, и для каждого розыгрыша они "
                     "разные. Количество победителей то же ограничено, их может быть один или несколько. Уже "
                     "купленные вами или другими покупателями номерки не доступны для покупки. После того как все "
                     "номерки будут куплены, рандомным образом выберутся победители, и все участники розыгрыша "
                     "будут уведомлены о конце розыгрыша, и о том, победил ли этот пользователь или нет. Победившему "
                     'потребуется отправить адрес для доставки приза.\n\nПосле нажатия на кнопку "📝 Посмотреть '
                     'текущий розыгрыш", если на данный момент есть активный розыгрыш, бот отправит данные этого '
                     'розыгрыша, а именно картинку приза и его описание или условия. Снизу будут номерки. Первый ряд, '
                     'ваши купленные номерки. Снизу, если номерок в таком виде: "9 🔴", это значит что данный номерок '
                     'уже куплен другим пользователем, если номерок в таком виде: "10 🟢", это значит что вы уже '
                     'купили данный номерок, если номерок в таком виде: "11 ⚪️", это значит что номерок свободен, '
                     'и его можно покупать, если номерок в таком виде: "12 🟡", то его собираются покупать. Кнопка '
                     'в середине - это количество номерков, слева и справа - это перемотка на предыдущию и на '
                     "следующию страницу номерков. Снизу цена нодного номерка в рублях. После выбора номерка, этот "
                     "номерок будет занят для других на 15 минут, и за эти 15 минут вы должны успеть купить этот "
                     "номерок. Если не успели, сообщение убирется. Если при просмотре текущего розыгрыша и его "
                     "номерков вы бездействуете минуту или две, то и в этом случае сообщение убирается, но вы заново "
                     "сможете отправить команду для просмотра текущего розыгрыша, и если ваш номерок не был куплен, "
                     "вы сможете его купить. Желаем вам победить в наших розыгрышах 🔥🔥🔥"),
    "request_adress": "📬 Напишите адресс для доставки приза:",
    "response_adress": "📬 Адрес для доставки был отправлен организаторам. Они могут свами связаться в бижайшее время "
                       "👀"
}
